
#text = "{name]" is {age} years old".format(name = " John", age = 30)
#print = "Hallo", "you a yers old" (name = " John", age = 30):

#name = Jan
#age = 30
#text = " My name is %s and you is %d yers old" %

#def smth():
   # i=100
    #print(i)
    #i=1
    #for j in range(10):
        #if i%2==0:
            #print(i)
        #else:
            #smth()
        #i+=1

        #def smth():
#def my_len(str1,str2):
    #return len(f"{str1}{str2}")
#company1 = "apple"
#company2 = "samsung"

#print(my_len(company1, company2))
#print(my_len("apple","samsung"))


#arr = list(range(1,11))

#def check_i(i):
   # if i%3 == 0 or i%5 == 0:
        #return True
   # return False
#s = 0
#for j in arr:
    #if check_i(j):
       # s+=j
#print(s)
#2.Напишите программу, которая принимает список чисел от пользователя и выводит на экран только уникальные числа из списка в порядке их появления.
#Используйте динамический массив для хранения уникальных чисел и методы для работы с ним. Выведите результат на экран с помощью команды print.
#Пример вывода:
#Введите числа, разделенные пробелами: 1 2 3 4 2 3 1 5
#Уникальные числа: [1, 2, 3, 4, 5]

#str_list-=input().split()
#print(str_list)
#a = list(map(int,str_split))
#print(a)

#a = list(map(int, input().split()))
#uniquie_numbers=[]
#for i in a:
 #   if i not in uniquie_numbers:
  #      uniquie_numbers.append(i)
#print(uniquie_numbers)

#a = list(map(int, input().split()))
#unique_numbers = []
#for i in a:
 #   if i not in unique_numbers:
  #      unique_numbers.append(i)
#print(unique_numbers)

#str = input()
#arr_str = str.split()
#new_str = arr_str[::-1]
#print("".join(arr_str[::-1]))



