#1.Веб-страницы состоят из строк типа
#"<i>Yay</i>" - выводит текст Yay курсивом. В этом
#примере, строка-тег “i” означает <i> и </i>, которые окружают слово Yay. Нам дана строка-тэг и текст. Написать программу, которая выводит тег вокруг данного текста, например,  "<i>Yay</i>". Например, ('i', 'Hello') →
#'<i>Hello</i>'.

#stroka = input("text infugen: ")
#tegname = input("Tagname: ")
#teg1 = f"<{tegname}> {stroka} </{tegname}>"
#print(teg1)
#
#Дана строка. Написать программу, которая создает строку из трех копий последних двух символов данной строки

#input_str = input("Hello")
#last_two_chars = input_str[-2:]
#result = last_two_chars * 3
#print(result)

#4.Написать программу, которая печатает True, если слова “cat” и “dog” встречаются в строке
#одинаковое количество раз (и напечатать false - если разное количество раз).
#'catdog' → True, 'catcat' → False, '1cat1cadodog' → True



